CSI API ETABS v1

# cDesignSteelEurocode_3_2005 Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDStEurocode_3_2005 Eurocode_3_2005 { get; }

    ReadOnly Property Eurocode_3_2005 As cDStEurocode_3_2005
    	Get

    Dim instance As cDesignSteel
    Dim value As cDStEurocode_3_2005

    value = instance.Eurocode_3_2005

    property cDStEurocode_3_2005^ Eurocode_3_2005 {
    	cDStEurocode_3_2005^ get ();
    }

    abstract Eurocode_3_2005 : cDStEurocode_3_2005 with get

#### Property Value

Type: cDStEurocode_3_2005

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com